{
"overall_summary": "Amendment is a progressive step towards modern corporate regulation. Reduced penalties under this amendment will help MSMEs grow sustainably. The provision aligns well with global corporate governance standards. Amendment is a progressive step towards modern corporate regulation. Reduced penalties under this amendment will help MSMEs grow sustainably. The provision aligns well with global corporate governance standards. I strongly support this amendment as it promotes transparency and accountability. This change will encourage better corporate governance practices. The amendment is a progressive step towards modern corporate regulation. Reduced penalties under this amendment will help MSMEs grow sustainably. The amendment appears reasonable, though implementation will be important. Some provisions are clear while others need more explanation. The changes seem manageable but require proper awareness. The amendment is neither significantly beneficial nor harmful. The amendment is neither significantly beneficial nor harmful. Further stakeholder consultation would be useful. The changes seem manageable but require proper awareness. understand the amendment. The amendment complicates existing compliance procedures. The draft law ignores practical implementation issues. The amendment may negatively impact ease of doing business. This proposal does not adequately consider MSME challenges.", 
"emotion_summaries": {
    "Negative": "The amendment may increase operational costs for companies. This proposal does not adequately consider MSME challenges. The changes could lead to increased litigation. The draft law ignores practical implementation issues. The amendment may negatively impact ease of doing business. The amendment complicates existing compliance procedures. The draft law ignores practical implementation issues. The amendment may negatively impact ease of doing business. This proposal does not adequately consider MSME challenges. The changes could lead to increased litigation. The amendment complicates existing compliance procedures. The draft law ignores practical implementation issues. The amendment may negatively impact ease of doing business. This proposal requires substantial reworking before implementation. The changes could lead to increased litigation.", 
    "Neutral": "The draft law introduces incremental changes rather than major reforms. The impact of the amendment will depend on enforcement mechanisms. The changes seem manageable but require proper awareness. The amendment is neither significantly beneficial nor harmful. The draft law introduces incremental changes rather than major reforms. The impact of the amendment will depend on enforcement mechanisms. The changes seem manageable but require proper awareness. The amendment is neither significantly beneficial nor harmful. The draft law introduces incremental changes rather than major reforms. The impact of the amendment will depend on enforcement mechanisms. The changes seem manageable but require proper awareness. The amendment is neither significantly beneficial nor harmful. The amendment appears reasonable, though implementation will be important. Some provisions are clear while others need more explanation. The impact of the amendment will depend on enforcement mechanisms. The changes seem manageable but require proper awareness.", 
    "Positive": "I strongly support this amendment as it promotes transparency and accountability. The amendment is a progressive step towards modern corporate regulation. Reduced penalties under this amendment will help MSMEs grow sustainably. The provision aligns well with global corporate governance standards. The amendment is a progressive step towards modern corporate regulation. Reduced penalties under this amendment will help MSMEs grow sustainably. The provision aligns well with global corporate governance standards. I strongly support this amendment as it promotes transparency and accountability. The amendment is a progressive step towards modern corporate regulation. Reduced penalties under this amendment will help MSMEs grow sustainably. The provision aligns well with global corporate governance standards. I strongly support this amendment as it promotes transparency and accountability. The amendment is a progressive step towards modern corporate regulation. Reduced penalties under this amendment will help MSMEs grow sustainably. The provision aligns well with global corporate governance standards. I strongly support this amendment as it promotes transparency and accountability. I strongly support this amendment as it promotes transparency and accountability. The amendment is a progressive step towards modern corporate regulation. Reduced penalties under this amendment will help MSMEs grow sustainably. The provision aligns well with global corporate governance standards."
    }
}